Revit 2027 API
RoutingPreferenceRule.GetCriterion Method
 Gets the specified criteria.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RoutingCriterionBase GetCriterion(
	int index
)
Public Function GetCriterion (
	index As Integer
) As RoutingCriterionBase
public:
RoutingCriterionBase^ GetCriterion(
	int index
)
member GetCriterion :
        index : int -> RoutingCriterionBase
Parameters
index Int32
Return Value
RoutingCriterionBase
 The criterion at the specified zero-based index position.
Exceptions
Exception | Condition
ArgumentException |  index is not a valid zero-based index. -or- Thrown if the index is out of bounds.
See Also
Reference
RoutingPreferenceRule Class
Autodesk.Revit.DB Namespace